In [9]:
import numpy as np

In [10]:
import pandas as pd

In [11]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [13]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index,columns= ['A', 'B'])

In [14]:
df

             A         B
G1 1 -1.397116  1.960522
   2 -0.392393  1.003925
   3 -1.003914  0.743591
G2 1 -0.166984 -0.470038
   2  0.474651 -0.669672
   3  0.425681 -0.854395

In [15]:
df.loc['G1']

          A         B
1 -1.397116  1.960522
2 -0.392393  1.003925
3 -1.003914  0.743591

In [16]:
df.loc['G1'].loc[1]

A   -1.397116
B    1.960522
Name: 1, dtype: float64

In [17]:
df.index.names

FrozenList([None, None])

In [18]:
df.index.names = ['Groups', 'Num']

In [19]:
df

                   A         B
Groups Num
G1     1   -1.397116  1.960522
       2   -0.392393  1.003925
       3   -1.003914  0.743591
G2     1   -0.166984 -0.470038
       2    0.474651 -0.669672
       3    0.425681 -0.854395

In [25]:
df.loc['G1'].loc[3]['B']

0.7435909227468913

In [26]:
df.loc['G2'].loc[2]['A']

0.47465051587139456

In [27]:
#how would you grab num level 1 from both G1 and G2? To grab such cross sections df.xs is more useful

In [28]:
df.xs('G1')

            A         B
Num
1   -1.397116  1.960522
2   -0.392393  1.003925
3   -1.003914  0.743591

In [32]:
df.xs(1, level= 'Num')

               A         B
Groups
G1     -1.397116  1.960522
G2     -0.166984 -0.470038